<%@ page contentType="text/html;charset=UTF-8" language="java" %>
  <h1>Servlets</h1>
<p>
  Сервлети у Java - спеціалізовані класи, призначені для мережевих задач.
  Зокрема, HttpServlet - для веб-задач, аналог контролерів
</p>
<p>
  Роботу з сервлетами забезпечує Servlet-API, що встановлюється як
  окремі бібліотеки (залежностями)
</p>
<p>
  Порядок роботи з сервлетами наступний:
</p>
  <ul>
    <li>Описуємо клас сервлету</li>
    <li>Якщо це сервлет з представленнями (View), то створюємо JSP файл</li>
    <li>У сервлеті переадресовуємо (Forward) на представлення</li>
    <li>
      Реєструємо сервлет (зв'язуємо його з веб-адресою)
      одним з наступних способів
      <ul>
        <li>За допомогою web.xml</li>
        <li>Анотацією @WebServlet</li>
        <li>Інструментами IoC</li>
      </ul>
    </li>
  </ul>
